
access1#
access1#terminal width 511
access1#terminal length 0
access1#
access1#
access1#
access1#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
access1(config)#
access1(config)#hostname SW-ACCESS-1
SW-ACCESS-1(config)#vtp domain ********123
Domain name already set to ********123.
SW-ACCESS-1(config)#vlan 10
SW-ACCESS-1(config-vlan)#name NhanVien
SW-ACCESS-1(config-vlan)#interface e0/0
SW-ACCESS-1(config-if)#switchport mode access
SW-ACCESS-1(config-if)#switchport access vlan 10
SW-ACCESS-1(config-if)#int range e0/1-2
SW-ACCESS-1(config-if-range)#switchport trunk encap dot1q
SW-ACCESS-1(config-if-range)#switchport mode trunk
SW-ACCESS-1(config-if-range)#spanning-tree mode rapid
SW-ACCESS-1(config)#int e0/0
SW-ACCESS-1(config-if)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on Ethernet0/0 but will only
 have effect when the interface is in a non-trunking mode.
SW-ACCESS-1(config-if)#spanning-tree bpduguard enable
SW-ACCESS-1(config-if)#
SW-ACCESS-1(config-if)#end
SW-ACCESS-1#
SW-ACCESS-1#
SW-ACCESS-1#exit
